/**

                            Online Swift Compiler.
                Code, Compile, Run and Debug Swift script online.
Write your code in this editor and press "Run" button to execute it.

*/


import Foundation
// Домашнее задание
/*1.	Вывести в консоль все четные числа от 0 до 100, включая 0

for n in 0...100 where n % 2 == 0 {
    print (n)
}
*/

/*2.	Создать две переменных, одна равна 7, другая 20. Если результат перемножения этих переменных больше 10, 
то вывести в консоль первую переменную, в противном случае вывести вторую.

var a: Int = 7
var b: Int = 20
if a*b > 10 {
    print (a)
} else {
    print (b)
}
*/

/*3.	Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечетным числам,, 
если текущее число плюс “k” четное, то увеличьте  “k” на 2, в противном случае выведите в консоль “Next ” 
и перейдите к следующей итерации*/

/*var k: Int = 9
for i in 10...50 where i % 2 != 0 {
    var k = 9
    if (i+k) % 2 == 0 {
    k += 2
    continue
} else {
    print ("Next")
}
}*/

/*4.	Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечетным числам,, 
если текущее число плюс “k” четное, то увеличьте  “k” на 1, в противном случае выведите в консоль “Next ” 
прекратите выполнение цикла*/

var k: Int = 9
for i in 10...50 where i % 2 != 0 {
    var k = 9
    if (i+k) % 2 == 0 {
    k += 2
} else {
    print ("Next")
    break
}
}
