var a = 10
var b = 100



/*Задачи:
1.	Используя переменные и константы из предыдущих заданий напишите код: 
сделайте “a” переменной, затем, пока “a” не станет равно 50 уменьшать “b” на 2

*/

while a != 50 {
    b -= 2
    a += 1
}


/*2.	Используя переменные и константы из предыдущих заданий напишите код: последовательно увеличить “b” 
сначала на 3, потом на 4, потом на 5, используя цикл*/
var b: Int = 5
for i in 3..5{
    b += i
}


/*3.	Используя переменные и константы из предыдущих заданий напишите код: в диапазоне от 1 до 10, 
если “a” плюс текущее число в диапазоне  больше “b”, то увеличить “b”  на 30, в противном случае уменьшить “b” на 10 */

for i in 1...10 {
    
    if a + i > b {
        b += 30
    } else {
        b -= 10
    }
}


/*4.	Создайте переменную “k”, равную 5. В диапазоне от 20 до 30 ( не включая 30), 
если текущее число больше 25, то “k” уменьшить на 4, в противном случае “k” увеличить на 10 */
var k: Int = 5 
//var n = 20..<30
for i in 20..< 30 {
    if (i > 25){
    k -=4
} else {
    k +=10
}
}




/*5.	Если “k” больше  20, то уменьшите k на 10, в противном случае добавьте к “k” 1 */
if k > 20 {
    k -= 10
} else {
    k +=1
}


/*6.	Пока “k” не будет равно 40 необходимо уменьшать “b” на 3, а “a” увеличивать на 10, 
затем, если  “a” находится в диапазоне от 10 до 30, то вывести в консоль результат 
сложения “a” и “b”, если “a” в диапазоне от 31 до 50, то вывести в консоль 
результат вычисления “a” - “b”, если “a” в диапазоне от 51 до 100. 
то вывести в консоль результат перемножения “a” и “b”. Во всех остальных случаях перейти к следующей итерации */

// у меня в задаче №6 нет никаких итераций, они внутри предыдущих задач наверное
// так что сделал как мог ('k' присвоил 5 как в задаче 4 и увеличиваю
// на 1 в каждой уже своей итерации)

var k = 5

while k != 40 {
    b -= 3
    a += 10
    if 10 ... 30 ~= a {
        print(a + b)
    } else if 31 ... 50 ~= a {
        print(a - b)
    } else if 51 ... 100 ~= a {
        print(a * b)
    } else {
        k += 1
    }
    
    
    switch a {
        case 10...30: print(a+b)
        case 31...50: print(a-b)
        case 51...100: print(a*b)
        default: continue
    }
}

// THAT'S ALL, FOLKS!





6.	Домашнее задание
Условие:
1.	Вывести в консоль все четные числа от 0 до 100, включая 0
2.	Создать две переменных, одна равна 7, другая 20. Если результат перемножения этих переменных больше 10, 
то вывести в консоль первую переменную, в противном случае вывести вторую.
3.	Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечетным числам,, 
если текущее число плюс “k” четное, то увеличьте  “k” на 2, в противном случае выведите в консоль “Next ” 
и перейдите к следующей итерации
4.	Создайте переменную “k”, равную 9. В диапазоне от 10 до 50, но только по нечетным числам,, 
если текущее число плюс “k” четное, то увеличьте  “k” на 1, в противном случае выведите в консоль “Next ” 
прекратите выполнение цикла






















